{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 257,
  "eos_token_id": 258,
  "hidden_size": 16,
  "intermediate_size": 64,
  "max_position_embeddings": 512,
  "model_type": "llama",
  "num_attention_heads": 2,
  "num_hidden_layers": 1,
  "vocab_size": 259,
  "torch_dtype": "float32"
}